---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DemandFlowAndPressureLossNotSetInLossFamily
source: html/21da8bae-2003-4619-674b-91cbc374bb32.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.DemandFlowAndPressureLossNotSetInLossFamily Property

A calculation did not complete because the pressure loss value for element is not set. Select the element and enter a value for the Pressure Loss.

## Syntax (C#)
```csharp
public static FailureDefinitionId DemandFlowAndPressureLossNotSetInLossFamily { get; }
```